socialNetwork/results/scaling-on-bench1.5-may21/benchmark1.5-05-21-26_110416/st5-AttUpd/200.txt
Running 2m test @ http://155.98.37.84:80
  16 threads and 128 connections

  Thread calibration: mean lat.: 608.167ms, rate sampling interval: 3141ms
  Thread calibration: mean lat.: 564.768ms, rate sampling interval: 3354ms
  Thread calibration: mean lat.: 416.878ms, rate sampling interval: 2635ms
  Thread calibration: mean lat.: 403.087ms, rate sampling interval: 2457ms
  Thread calibration: mean lat.: 522.547ms, rate sampling interval: 2732ms
  Thread calibration: mean lat.: 511.419ms, rate sampling interval: 2555ms
  Thread calibration: mean lat.: 484.392ms, rate sampling interval: 2422ms
  Thread calibration: mean lat.: 318.078ms, rate sampling interval: 1855ms
  Thread calibration: mean lat.: 360.418ms, rate sampling interval: 2263ms
  Thread calibration: mean lat.: 411.017ms, rate sampling interval: 2621ms
  Thread calibration: mean lat.: 490.358ms, rate sampling interval: 3033ms
  Thread calibration: mean lat.: 465.554ms, rate sampling interval: 2689ms
  Thread calibration: mean lat.: 399.865ms, rate sampling interval: 2195ms
  Thread calibration: mean lat.: 555.368ms, rate sampling interval: 2717ms
  Thread calibration: mean lat.: 451.675ms, rate sampling interval: 2686ms
  Thread calibration: mean lat.: 322.945ms, rate sampling interval: 1789ms

-----------------------------------------------------------------------
Test Results @ http://155.98.37.84:80 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    35.59ms   99.97ms 333.82ms   98.56%
    Req/Sec    11.40      2.38    17.00     77.55%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   24.50ms
 75.000%   27.58ms
 90.000%   33.28ms
 99.000%  333.82ms
 99.900%    1.54s 
 99.990%    2.13s 
 99.999%    2.33s 
100.000%    2.33s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.663     0.000000            1         1.00
      18.527     0.100000         2094         1.11
      20.463     0.200000         4198         1.25
      22.111     0.300000         6291         1.43
      23.407     0.400000         8396         1.67
      24.495     0.500000        10471         2.00
      25.023     0.550000        11543         2.22
      25.567     0.600000        12578         2.50
      26.127     0.650000        13627         2.86
      26.783     0.700000        14668         3.33
      27.583     0.750000        15704         4.00
      28.079     0.775000        16229         4.44
      28.655     0.800000        16750         5.00
      29.343     0.825000        17270         5.71
      30.255     0.850000        17792         6.67
      31.439     0.875000        18314         8.00
      32.319     0.887500        18583         8.89
      33.279     0.900000        18840        10.00
      34.719     0.912500        19107        11.43
      36.735     0.925000        19361        13.33
      39.775     0.937500        19622        16.00
      41.759     0.943750        19753        17.78
      44.287     0.950000        19888        20.00
      47.583     0.956250        20015        22.86
      52.703     0.962500        20146        26.67
      61.695     0.968750        20276        32.00
      66.751     0.971875        20343        35.56
      73.407     0.975000        20407        40.00
      80.511     0.978125        20474        45.71
      91.391     0.981250        20538        53.33
     117.631     0.984375        20603        64.00
     140.287     0.985938        20636        71.11
     173.311     0.987500        20669        80.00
     294.655     0.989062        20702        91.43
     376.319     0.990625        20734       106.67
     514.047     0.992188        20767       128.00
     586.751     0.992969        20783       142.22
     694.271     0.993750        20800       160.00
     766.975     0.994531        20816       182.86
     854.015     0.995313        20832       213.33
     952.319     0.996094        20849       256.00
     999.423     0.996484        20857       284.44
    1048.063     0.996875        20865       320.00
    1099.775     0.997266        20873       365.71
    1224.703     0.997656        20881       426.67
    1348.607     0.998047        20890       512.00
    1388.543     0.998242        20894       568.89
    1460.223     0.998437        20899       640.00
    1472.511     0.998633        20902       731.43
    1502.207     0.998828        20906       853.33
    1541.119     0.999023        20910      1024.00
    1552.383     0.999121        20912      1137.78
    1556.479     0.999219        20914      1280.00
    1643.519     0.999316        20916      1462.86
    1674.239     0.999414        20918      1706.67
    1712.127     0.999512        20920      2048.00
    1713.151     0.999561        20921      2275.56
    1733.631     0.999609        20922      2560.00
    1803.263     0.999658        20923      2925.71
    1986.559     0.999707        20924      3413.33
    2030.591     0.999756        20925      4096.00
    2036.735     0.999780        20926      4551.11
    2036.735     0.999805        20926      5120.00
    2066.431     0.999829        20927      5851.43
    2066.431     0.999854        20927      6826.67
    2127.871     0.999878        20928      8192.00
    2127.871     0.999890        20928      9102.22
    2127.871     0.999902        20928     10240.00
    2187.263     0.999915        20929     11702.86
    2187.263     0.999927        20929     13653.33
    2187.263     0.999939        20929     16384.00
    2187.263     0.999945        20929     18204.44
    2187.263     0.999951        20929     20480.00
    2330.623     0.999957        20930     23405.71
    2330.623     1.000000        20930          inf
#[Mean    =       35.590, StdDeviation   =       99.967]
#[Max     =     2328.576, Total count    =        20930]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  22858 requests in 2.00m, 304.66MB read
  Socket errors: connect 0, read 0, write 0, timeout 379
Requests/sec:    190.47  
Transfer/sec:      2.54MB